#Задачи на циклы и оператор условия------
print('Задача 1 Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.')
for i in range(1,6):
    print(i, '00000')
print('\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 2 Пользователь в цикле вводит 10 цифр. Найти количество введеных пользователем цифр 5.')

t = ['первую', 'вторую', 'третю', 'четвертую', 'пятую', 'шестую', 'седьмую', 'восьмую', 'девятую', 'десятую']
s = 0
for i in range(10):
    print('Введите', t[i], 'цифру ', end='')
    n = int(input())
    if n == 5:
        s += 1
print('Введено цифр "5": ', s, '\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 3 Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.')

sum = 0
for i in range(1, 101):
    sum+=i
print(sum, '\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 4 Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.')

mul = 1
for i in range(1, 11):
    mul *= i
print(mul, '\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 5 Вывести цифры числа на каждой строчке.')

integer_number = 2129
while integer_number:
    print(integer_number % 10)
    integer_number = integer_number // 10
print('\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 6 Найти сумму цифр числа')
n = input()
sum = 0
for i in n:
    if i != '.':
        sum += int(i)
print(sum, '\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 7 Найти произведение цифр числа.')
n = input()
mul = 1
for i in n:
    if i != '.':
        mul *= int(i)
print(mul, '\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 8 Дать ответ на вопрос: есть ли среди цифр числа 5?')
integer_number = 213413
while integer_number>0:
    if integer_number%10 == 5:
        print('Yes')
        break
    integer_number = integer_number//10
else: print('No')
print('\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 9 Найти максимальную цифру в числе')
n = input()
z = []
for i in n:
    z.append(i)
print(max(z), '\n')

# ------------------------------------------------------------------------------------------------------------------
print('Задача 10 Найти количество цифр 5 в числе')
n = input()
s = 0
for i in n:
    if i != '.' and i == '5':
        s += 1
print('Цифр "5" в числе ', n, ': ', s)